<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Attribution</key>
	<dict>
		<key>Author</key>
		<dict>
			<key>Email</key>
			<string>ejohns03@calpoly.edu</string>
			<key>Name</key>
			<string>Eric Johnson</string>
		</dict>
		<key>Copyright</key>
		<string>Cal Poly San Luis Obispo</string>
	</dict>
	<key>Description</key>
	<string>Packages current release version of saml2aws</string>
	<key>Identifier</key>
	<string>edu.calpoly.pkg.saml2aws</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>saml2aws</string>
	</dict>
	<key>ParentRecipe</key>
	<string>edu.calpoly.download.saml2aws</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>etc</key>
					<string>0755</string>
					<key>etc/paths.d</key>
					<string>0755</string>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/saml2aws</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/usr/local/saml2aws</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>/usr/local/saml2aws</string>
				<key>file_mode</key>
				<string>0644</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/etc/paths.d/saml2aws</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>etc</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>edu.calpoly.pkg.saml2aws</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%pkgroot%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
