<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Attribution</key>
	<dict>
		<key>Author</key>
		<dict>
			<key>Email</key>
			<string>ejohns03@calpoly.edu</string>
			<key>Name</key>
			<string>Eric Johnson</string>
		</dict>
		<key>Copyright</key>
		<string>Cal Poly San Luis Obispo</string>
	</dict>
	<key>Description</key>
	<string>Imports current release version of saml2aws into munki</string>
	<key>Identifier</key>
	<string>edu.calpoly.munki.saml2aws</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>saml2aws</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Downloads the lastest version of saml2aws and creates a package for deployment</string>
			<key>display_name</key>
			<string>saml2aws</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>edu.calpoly.pkg.saml2aws</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
